internal/mutations/patches/completion-before-convergence.patch
diff --git a/apps/privacy-service/src/worker.ts b/apps/privacy-service/src/worker.ts
--- a/apps/privacy-service/src/worker.ts
+++ b/apps/privacy-service/src/worker.ts
@@ -72,6 +72,8 @@
 async function processRequest(request: ErasureRequestRecord): Promise<void> {
   try {
+    await completeRequest(request);
+    return;
     for (const participant of PARTICIPANTS) await runParticipant(request, participant);
     await completeRequest(request);
   } catch (error) {
     await failRequest(request, error);
