internal/mutations/patches/financial-invoice-lines-unsanitized.patch
diff --git a/apps/privacy-service/src/handlers/financial-records.ts b/apps/privacy-service/src/handlers/financial-records.ts
--- a/apps/privacy-service/src/handlers/financial-records.ts
+++ b/apps/privacy-service/src/handlers/financial-records.ts
@@ -64,15 +64,6 @@ export async function anonymizeFinancialRecords(request: ErasureRequestRecord):
       `UPDATE payments.invoices SET customer_id=$3,billing_snapshot=$4
        WHERE merchant_id=$1 AND customer_id=$2 RETURNING id`,
       [request.merchant_id, request.customer_id, request.surrogate_id, erasedCustomerBlock(context)],
     );
-    for (const invoice of invoices.rows) {
-      const lines = await client.query<{ id: string; description: string }>(
-        `SELECT id,description FROM payments.invoice_lines WHERE invoice_id=$1 FOR UPDATE`, [invoice.id],
-      );
-      for (const line of lines.rows) {
-        await client.query(`UPDATE payments.invoice_lines SET description=$2 WHERE id=$1`,
-          [line.id, redactSubjectValue(line.description, context)]);
-      }
-    }
   });
 }
