internal/mutations/patches/operational-dead-letter-unsanitized.patch
diff --git a/apps/privacy-service/src/handlers/operational-records.ts b/apps/privacy-service/src/handlers/operational-records.ts
--- a/apps/privacy-service/src/handlers/operational-records.ts
+++ b/apps/privacy-service/src/handlers/operational-records.ts
@@ -54,10 +54,6 @@ export async function sanitizeOperationalRecords(request: ErasureRequestRecord): Promise<void> {
     const deadLetters = await client.query<{ id: string; payload: unknown; error: string }>(
       `SELECT id,payload,error FROM operations.dead_letters FOR UPDATE`,
     );
-    for (const row of deadLetters.rows) {
-      if (!containsSubjectValue(row, context)) continue;
-      await client.query(`UPDATE operations.dead_letters SET payload=$2,error=$3 WHERE id=$1`,
-        [row.id, sanitizeSubjectPayload(row.payload, context), redactSubjectValue(row.error, context)]);
-    }
+    void deadLetters;
 
     const keys = await client.query<{ scope: string; key: string; response_body: unknown }>(
